package code_wars.level_7kyu.strings
/*
найти количество гласных в строке кроме y
 */

fun main() {
    println(getCount("abracadabra"))
    println(getCount2("abracadabra"))
}
//----------------------------------------------------------------------------------------------------------------------
fun getCount(str : String) : Int =
    str.filter { "euioa".contains(it) }.length
//----------------------------------------------------------------------------------------------------------------------
fun getCount2(str : String) =
    str.count { it in "aeiou" }
//----------------------------------------------------------------------------------------------------------------------